In [2]:
import pandas as pd

titanic = pd.read_csv(r"C:\Users\polit\python_Pandas\titanic.csv")
titanic.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

# 칼럼 별 집계

In [12]:
titanic['Age'].mean()

29.69911764705882

In [13]:
titanic.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [16]:
# 평균
titanic[['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

In [17]:
# 중앙값(그냥 중앙에 있는 값)
titanic[['Age', 'Fare']].median()

Age     28.0000
Fare    14.4542
dtype: float64

In [21]:
# 요약통계를 다 보여줌
titanic.describe()
titanic[['Fare', 'Age']].describe()

             Fare         Age
count  891.000000  714.000000
mean    32.204208   29.699118
std     49.693429   14.526497
min      0.000000    0.420000
25%      7.910400   20.125000
50%     14.454200   28.000000
75%     31.000000   38.000000
max    512.329200   80.000000

In [25]:
# 요약통계를 선택해서 보기
titanic.agg({
    'Age' : ['max', 'min', 'mean'],
    'Fare' : ['mean', 'min', 'max']
}) # 첫번째 칼럼에 맞춰짐

            Age        Fare
max   80.000000  512.329200
min    0.420000    0.000000
mean  29.699118   32.204208

# 그룹별 집계
## SQL
### SELECT Sex, AVG(Age)
### FROM titanic
### GROUP BY Sex

In [6]:
# 성별을 기준으로 모든 컬럼의 mean을 연산 
titanic.groupby('Sex').mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [32]:
# 성별을 기준으로 Age 컬럼의 mean을 연산할 것이다. 
titanic.groupby('Sex')['Age'].mean() # Age 컬럼 하나니까 --> Series

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [5]:
# Sex를 기준으로 Pclass를 나눈 후 Age 컬럼을 연산(Sex, Pclass가 기준 컬럼)
a = titanic.groupby(['Sex', 'Pclass'])['Age'].mean()
a
print(type(a)) # Series이다(Age 컬럼하나)
a 

# sex, pclass는 index이다.
# index를 coiumn으로 같이 보고싶으면
# a.reset_index()을 해주면 된다
# 그리고 새로운 인덱스가 들어오게 된다
a.reset_index()

<class 'pandas.core.series.Series'>

      Sex  Pclass        Age
0  female       1  34.611765
1  female       2  28.722973
2  female       3  21.750000
3    male       1  41.281386
4    male       2  30.740707
5    male       3  26.507589

In [38]:
# Pclass를 기준으로 Sex를 나눈 후 Age 컬럼을 연산(Pclass, Sex가 기준 컬럼)
titanic.groupby(['Pclass', 'Sex'])['Age'].max()

Pclass  Sex
1       female    63.0
        male      80.0
2       female    57.0
        male      70.0
3       female    63.0
        male      74.0
Name: Age, dtype: float64

# 그룹 별 데이터의 규모 파악하기

In [40]:
titanic.groupby('Pclass').count() # count() 개수를 세는 메소드

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [42]:
titanic.groupby('Pclass')['PassengerId'].count()

Pclass
1    216
2    184
3    491
Name: PassengerId, dtype: int64

In [44]:
titanic['Pclass'].value_counts() # pandas에서 지원하는 개수 세는 메소드

3    491
1    216
2    184
Name: Pclass, dtype: int64

### size()와 count()

In [58]:
titanic.info() # info()로 None을 찾음

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [60]:
# count()는 Non을 제외하고 개수를 리턴
titanic.groupby('Pclass')['Age'].count().sum()

714

In [61]:
# size()는 Non을 포함해서 개수를 리턴(row의 개수와 같음)
titanic.groupby('Pclass')['Age'].size().sum()

891

In [67]:
# value_counts()도 Non을 제외하고 개수를 리턴
titanic['Age'].value_counts().sum()

714

In [68]:
titanic['Age'].value_counts(dropna = False).sum()

891